Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/social_welfare/social_welfare_payments/disability_and_illness/partial_capacity_benefit.html.txt.tmx
Source language: en
Languages: ga

source: • Rates • How to apply
ga: • Conas iarratas a dhéanamh

source: Partial Capacity Benefit is a social welfare scheme which allows you to return to work or self-employment (if you have reduced capacity to work) and continue to receive a payment from the Department of Social Protection
ga: Scéim leasa shóisialaigh atá sa Sochar Cumais Pháirtigh a ligeann duit filleadh ar an obair (má tá agat cumas laghdaithe le hoibriú) agus le leanúint agus íocaíocht a fháil ón Rannóg seo

source: If you have been getting Illness Benefit (for a minimum of 6 months) or Invalidity Pension and wish to return to work you may qualify for Partial Capacity Benefit if your capacity for work is reduced by your medical condition
ga: Má tá Sochar Breoiteachta á fháil agat (ar feadh 6 mhí ar a laghad) nó Pinsean Easláinte á fháil agat, agus más mian leat filleadh ar an obair, d’fhéadfá cáiliú don Sochar Cumais Pháirtigh má tá do chumas chun oibrithe laghdaithe ag do riocht míochaine

source: You will qualify for Partial Capacity Benefit if your restriction on capacity for work is assessed as moderate, severe, or profound
ga: Cáileofar thú don Sochar Cumais Pháirtigh má mheastar go bhfuil srian measartha, dian nó trom an srian ar do chumas oibre

source: If it is assessed as mild you will not qualify and your continued eligibility to Illness Benefit or Invalidity Pension will also be reviewed
ga: Má mheastar go bhfuil srian éadrom ar do chumas, ní cháileoidh tú agus déanfar athbhreithniú ar do theidlíocht i leith an tSochair Bhreoiteachta agus an Phinsin Easláinte freisin

source: Participation on the Partial Capacity Benefit scheme is voluntary and you may return to Illness Benefit or Invalidity Pension if, for example, your employment ceases or if you find you cannot continue to work
ga: Is ar bhonn deonach atá an rannpháirtíocht ar scéim an tSochair Cumais Pháirtigh agus tá cead agat Sochar Breoiteachta nó Pinsean Easláine a fháil arís, mar shampla, sa chás go dtagann deireadh le d'fhostaíocht nó má fhaigheann tú amach nach féidir leat leanúint de do chuid oibre

source: You do not have to transfer onto the Partial Capacity Scheme if you wish to do voluntary work
ga: Ní gá go mbeidh an obair a dhéanann duine fad a bhíonn an Sochar Cumais Pháirtigh á fháil acu ar mhaithe le cuspóirí athshlánaithe nó teiripeacha

source: Replacement of exemption arrangements
ga: Is ar bhonn deonach atá an rannpháirtíocht ar scéim an tSochair Cumais Pháirtigh

source: There is no requirement that the work a person does while on Partial Capacity Benefit has to be for rehabilitative or therapeutic purposes
ga: Ní gá duit a aistriú isteach ar an Shochar Cumais Pháirtigh mian leat obair dheonach a dhéanamh

source: If you are on Illness Benefit or Invalidity Pension and want to do a FET (formerly FÁS) training course, you do not go onto Partial Capacity Benefit
ga: Má fhaigheann tú Sochar Breoiteachta nó Pinsean Easláinte agus más mian leat cúrsa oiliúna FET a dhéanamh, ní chuireann tú ar Shochar Cumais Pháirtigh

source: You apply to the Illness Benefit or Invalidity Pension section, as appropriate
ga: D’fhéadfá an liúntas oiliúna a fháil anuas ar do ghnáthíocaíocht leasa shóisialaigh

source: From 1 January 2014 new participants do not get a training allowance and a social welfare payment together
ga: Ó 1 Éanair 2014 ní fhaigheann rannpháirtithe nua liúntas oiliúna SOLAS

source: You cannot get Partial Capacity Benefit and take part in a Community Employment Scheme
ga: Ní féidir leat Sochar Cumais Pháirtigh agus Scéim Fhostaíochta Pobail a fháil

source: To qualify for Partial Capacity Benefit you need to be currently getting either:
ga: Chun cáiliú don Sochar Cumais Pháirtigh, is gá duit ceann den dá rud seo a leanas a bheith á fháil agat:

source: • Illness Benefit (for a minimum of 6 months)
ga: • Sochar Breoiteachta (ar feadh 6 mhí ar a laghad)

source: You may not work until you have received written approval to do so from the Department of Social Protection
ga: Ní féidir leat oibriú go dtí go bhfaigheann tú cead i scríbhinn chun amhlaidh a dhéanamh ón Roinn Coimirce Sóisialaí

source: You should also get the approval of your doctor before taking up employment
ga: Ba cheart duit cead a fháil ó do dhochtúir sula nglacann tú le fostaíocht

source: There is no restriction on earnings or number of hours you can work
ga: Ní ann d’aon srianta ar thuillimh ná ar an líon uaireanta is féidir leat oibriú

source: You can get Partial Capacity Benefit and a half-rate Carer's Allowance together
ga: Má fhaigheann tú Sochar Cumais Pháirtigh, is féidir leat obair mar dhuine féinfhostaithe

source: Note that Disability Allowance and Blind Pension are not qualifying payments for Partial Capacity Benefit
ga: Tabhair faoi deara nach íocaíochtaí cáilithe don Sochar Cumais Pháirtigh iad Liúntas Míchumais agus Pinsean na nDall

source: How long does payment last?
ga: Cá fhad a mhaireann an íocaíocht?

source: Payment will last as long as you have an underlying entitlement to Illness Benefit or Invalidity Pension
ga: Mairfidh an íocaíocht fad is a bheidh teidlíocht bhunúsach agat ar íocaíocht an tSochair Bhreoiteachta nó an Phinsin Easláine

source: Your continued entitlement to Partial Capacity Benefit is subject to review and you may be required to attend a medical assessment by a medical assessor
ga: an Sochar Cumais Pháirtigh faoi réir athbhreithnithe agus is féidir go mbeidh ort freastal ar mheasúnú leighis ó Mheasúnóir Leighis

source: Partial Capacity Benefit is made up of a personal rate for you and may include increases for your qualified adult and qualified child(ren)
ga: Ráta pearsanta duit féin agus méaduithe i leith duine fásta agus leanbh/leanaí cáilithe a bheadh sa Sochar Cumais Pháirtigh

source: The personal rate of payment is based on the assessment of your restriction on capacity for work, whether you were in receipt of Illness Benefit or Invalidity Pension and your current rate of payment
ga: Bunaítear an ráta pearsanta ar mheasúnú ar an srianadh ar do chumas oibre cibé acu an raibh Sochar Breoiteachta nó Pinsean Easláinte á fháil agat agus ar ráta reatha d’íocaíochta

source: │Medical assessment │% of your personal rate of Illness Benefit or Invalidity Pension payment │
ga: │Measúnú ó thaobh Míochaine │% de do ráta pearsanta íocaíochta den Sochar Breoiteachta nó den Phinsean Easláinte │

source: Increases for qualified children and adults continue to be paid at the same rate
ga: Leanfar méadaithe do leanaí cáilithe agus do dhaoine fásta cáilithe a bheith íoctha ag an ráta céanna

source: The conditions for payment of increases are the same as those that applied to your Illness Benefit or Invalidity Pension claim. Maximum rates of Partial Capacity Benefit in 2016 and up to March 2017
ga: Is mar an gcéanna iad na coinníollacha d’íocaíocht mhéadaithe do leanbh cáilithe agus/nó do leanaí cáilithe agus iad siúd a bhí i gceist le d'éileamh ar Shochar Breoiteachta nó ar Phinsean Easláinte

source: Maximum rates of Partial Capacity Benefit from March 2017
ga: Uasrátaí an tSochair Cumais Pháirtigh ó Márta 2017

source: │Medical Assessment │Person previously getting Illness Benefit at the maximum personal rate €193.00 (from 13 March 2017) │Person aged under 66 and previously getting Invalidity Pension at the maximum personal rate €198.50 (from 16 March 2017) │
ga: │Measúnú Leighis │Duine ag a raibh Sochar Breoiteachta á fháil ag an uasráta pearsanta €193.00 (ó 13/03/17) │Duine faoi bhun 66 bliain d’aois agus ag a raibh Pinsean Easláinte á fháil ag an uasráta pearsanta €198.50 (ó 16/03/17) │

source: │Moderate │€96.50 │€99.25 │
ga: │Measartha │€96.50 │€99.25 │

source: │Severe │€144.75 │€148.88 │
ga: │Dian │€144.75 │€148.88 │

source: │Profound │€193.00 │€198.50 │
ga: │Trom │€193.00 │€198.50 │

source: Partial Capacity Benefit will be paid directly by Electronic Funds Transfer (EFT) into your Irish bank or building society account (not a mortgage account)
ga: Íocfar an Sochar Cumais Pháirtigh go díreach isteach i do chuntas bainc Éireannach nó isteach i do chuntas cumann foirgníochta (ní íocfar é isteach i gcuntas mórgáiste)

source: You cannot keep your Fuel Allowance. If you were getting Invalidity Pension and a Living Alone Allowance (LAA) with your Invalidity Pension (or you start to live alone while you are getting PCB) your rate of PCB will be calculated on the basis of your Invalidity Pension and your LAA
ga: Má bhí Pinsean Easláinte á fháil agat agus má bhí tú i dteideal Saorthaistil nó Liúntas Oileáin, is féidir leat iad a choimeád má cháilítear thú don Sochar Cumais Pháirtigh

source: You can also keep Free Travel and/or the Household Benefits Package but they will both be means-tested after the first 2 years and annually after that
ga: Má bhí an Pacáiste Sochar Teaghlaigh á fháil agat is féidir leat é a choimeád freisin, faoi réir tástáil mhaoine tar éis 2 bhliain

source: You should check with the Department of Social Protection's representative (formerly known as the Community Welfare Officer) in your local health centre to see how your Rent Supplement or Mortgage Interest Supplement may be affected by your participation in the Partial Capacity Scheme
ga: Má ghlacann tú páirt sa Scéim Cumais Pháirtigh ba chóir duit seiceáil leis ionadaí na Roinne Coimirce Sóisialaí (tugadh Oifigeach Leasa Pobal) i d’ionad sláinte áitiúil chun fáil amach an mbeidh tionchar ar d’ Fhorlíonadh Cíos nó d’ Fhorlíonadh Ús Morgáiste

source: Contact the Partial Capacity Benefit Section of the Department of Social Protection
ga: Déan teagmháil le Rannóg Sochar Cumais Pháirtigh den Roinn Coimirce Sóisialaí

source: They will send out an application form to you (forms are not currently available online)
ga: Seolfaidh siad foirm iarratais chugat

source: A Medical Assessor will assess the restriction on your capacity for work
ga: Déanfaidh Lia-Mheasúnóir measúnú ar an srian ar do chumas oibre

source: This may require you to attend a medical assessment
ga: D’fhéadfadh go mbeadh gá ort measúnú leighis a fhreastal

source: If you were getting Invalidity Pension you will be transferred automatically to a State Pension (Contributory) when you turn 66
ga: Ba cheart duit an uile fhianaise chuí leighis a áireamh le d’iarratas

source: If you were getting Illness Benefit you must apply for a State pension and you should do so at least 3 months before your 66th birthday. Appeals
ga: Má cháilítear thú don Sochar Cumais Pháirtigh, ní bheidh ort deimhnithe leighis a sheoladh isteach
